app/views/wikis/edit.html.erb

<h3>Collaborator List</h3>
<% @wiki.collaborators.each do |c| %>
---
SELECT "collaborators".* FROM "collaborators" WHERE "collaborators"."wiki_id" = ?  [["wiki_id", 160]]