app/controllers/collaborators_controller.rb

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 160]]
INSERT INTO "collaborators" ("user_id", "wiki_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["wiki_id", 1], ["created_at", "2016-06-03 16:00:23.654808"], ["updated_at", "2016-06-03 16:00:23.654808"]]
---
  def create
    @wiki = Wiki.find(params[:collaborator][:wiki_id])
    @collaborator = @wiki.collaborators.build(user_id: params[:collaborator][:user_id])

    if @collaborator.save

SELECT  "collaborators".* FROM "collaborators" WHERE "collaborators"."id" = ? LIMIT 1  [["id", 12]]
DELETE FROM "collaborators" WHERE "collaborators"."id" = ?  [["id", 12]]
---
  def destroy
    @collaborator = Collaborator.find(params[:id])
    wiki = @collaborator.wiki

    if @collaborator.destroy