app/controllers/wikis_controller.rb

  def show
    @wiki = Wiki.find(params[:id])
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @wiki = Wiki.new(wiki_params)
    @wiki.user = current_user
    @wiki.private = params[:wiki][:private]
    authorize @wiki

    if @wiki.save
---
INSERT INTO "wikis" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Wiki 1"], ["body", "Wiki 1 Wiki 1 Wiki 1"], ["created_at", "2016-05-16 15:45:50.734781"], ["updated_at", "2016-05-16 15:45:50.734781"]]

  def edit
    @collaborator = Collaborator.new
    @wiki = Wiki.find(params[:id])
    @collaborators = @wiki.collaborators
    collab_users = @wiki.users
    @users = User.where.not(id: current_user.id).map{|u| [u.email, u.id] unless collab_users.include?(u)}.compact
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 2]]
SELECT  1 AS one FROM "users" INNER JOIN "collaborators" ON "users"."id" = "collaborators"."user_id" WHERE "collaborators"."wiki_id" = ? AND "users"."id" = ? LIMIT 1  [["wiki_id", 1], ["id", 1]]
SELECT "users".* FROM "users"

  def update
    @wiki = Wiki.find(params[:id])
    @wiki.assign_attributes(wiki_params)
    @wiki.private = params[:wiki][:private]
    authorize @wiki

    if @wiki.save
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "wikis" SET "title" = ?, "private" = ?, "updated_at" = ? WHERE "wikis"."id" = ?  [["title", "Adding Collab 2 edit"], ["private", "f"], ["updated_at", "2016-06-03 00:07:14.828668"], ["id", 129]]

  def destroy
    @wiki = Wiki.find(params[:id])
    authorize @wiki

    if @wiki.destroy
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "wikis" WHERE "wikis"."id" = ?  [["id", 1]]